[
  {
    "name": "History & Physical",
    "description": "Evaluates whether the consult note captures the key aspects of the patient’s history and physical exam that are pertinent to the consult question. The section should reflect accuracy, focus, and inclusion of essential details, while avoiding irrelevant or extraneous information.",
    "examples": "1 = Limited | 2 = Developing | 3 = Competent | 4 = Strong | 5 = Complete & Concise",
    "max_score": 5,
    "order": 1,
    "score_guidance": {
      "1": "Limited: Missing or inaccurate; irrelevant details dominate; critical findings absent.",
      "2": "Developing: Some relevant info, but major omissions or questionable accuracy.",
      "3": "Competent: Captures main story and exam, but misses some pertinent positives/negatives or includes minor irrelevant info.",
      "4": "Strong: Accurate, mostly complete, focused on key findings; only minimal extraneous content.",
      "5": "Complete & Concise: All essential findings included, no fluff; brief if straightforward (e.g., appendicitis), more detailed if complex (e.g., Crohn’s obstruction), but always targeted and relevant."
    }
  },
  {
    "name": "Assessment & Clinical Reasoning",
    "description": "Evaluates the quality of the resident’s interpretation of the case. This section should go beyond restating the history; it should demonstrate synthesis, provide a leading diagnosis (or outline what is needed to establish one), and acknowledge alternative possibilities when appropriate. The level of detail should be tailored to the case complexity — concise for straightforward consults and more detailed for complex cases — but always relevant.",
    "examples": "1 = Limited | 2 = Developing | 3 = Competent | 4 = Strong | 5 = Complete & Concise",
    "max_score": 5,
    "order": 2,
    "score_guidance": {
      "1": "Limited: Restates HPI without analysis; no diagnosis or impression offered.",
      "2": "Developing: Impression vague or incomplete; does not answer consult question; no reasoning or alternatives considered.",
      "3": "Competent: States a working diagnosis, but with little justification; may omit uncertainty or differential.",
      "4": "Strong: Provides a clear summary and leading diagnosis; supports with at least one key fact; mentions one alternative or data pending.",
      "5": "Complete & Concise: Concise synthesis that takes a stand (or states what’s needed); justified with relevant findings; alternatives addressed; short and direct if obvious, more detailed if complex."
    }
  },
  {
    "name": "Plan & Management",
    "description": "Evaluates the clarity, specificity, and appropriateness of the management plan. The plan should respond directly to the consult question, outline specific next steps, and anticipate contingencies. It should not be vague (e.g. “per ICU”) or avoidant, but instead provide actionable recommendations.",
    "examples": "1 = Limited | 2 = Developing | 3 = Competent | 4 = Strong | 5 = Complete & Concise",
    "max_score": 5,
    "order": 3,
    "score_guidance": {
      "1": "Limited: No plan, unsafe, or irrelevant (e.g., “per ICU” without recommendations).",
      "2": "Developing: Vague (“continue care”), incomplete, or avoids giving recommendations.",
      "3": "Competent: Addresses primary problem but misses key steps; plan nonspecific.",
      "4": "Strong: Clear, appropriate plan addressing most issues; specific and actionable; may lack anticipation of next steps.",
      "5": "Complete & Concise: Directly answers consult request with specific, tailored recommendations; anticipates next steps (workup, OR vs non-op, contingencies). High‑yield if straightforward; more detailed if complex, but never vague."
    }
  },
  {
    "name": "Clarity & Efficiency",
    "description": "Evaluates how well the note is structured and whether it communicates information clearly and efficiently. Notes should be easy to follow, free of unnecessary repetition or copied material, and contain only relevant information. Both brief straightforward consults and appropriately detailed complex consults should be rewarded if written clearly and without fluff.",
    "examples": "1 = Limited | 2 = Developing | 3 = Competent | 4 = Strong | 5 = Complete & Concise",
    "max_score": 5,
    "order": 4,
    "score_guidance": {
      "1": "Limited: Disorganized, confusing, bloated with irrelevant/copy-forwarded text; key message obscured.",
      "2": "Developing: Some logical flow, but redundancy/clutter makes it hard to extract key points.",
      "3": "Competent: Understandable overall, but with mild redundancy, awkward phrasing, or minor irrelevant content.",
      "4": "Strong: Well‑structured, mostly concise; easy to follow; minimal extraneous detail.",
      "5": "Complete & Concise: Exceptionally clear, succinct, efficient. For simple cases, communicates everything in a few crisp lines; for complex cases, includes all needed details without fluff."
    }
  }
]

